import { FormalizedDocuments } from './interfaces/document-formalized.interfaces';
import { Document } from '../documents/documents.types';

export const DOCUMENTS: FormalizedDocuments = {
  '8.1.3': [
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130003',
      name: 'Донесение о переводе в всБГ',
      files: [
        {
          type: 'FODT',
          name: '8_1_3_донесение о выполнении мероприятий по переводу в всБГ.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_3_донесение о выполнении мероприятий по переводу в всБГ.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_3_донесение о выполнении мероприятий по переводу в всБГ.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_3_донесение о выполнении мероприятий по переводу в всБГ.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_3_донесение о выполнении мероприятий по переводу в всБГ.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
  ],
  '8.1.4': [
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Донесение по полетному заданию',
      files: [
        {
          type: 'XML',
          name: '8_1_4_Донесение по полетному заданию.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
      ],
    },
  ],
  '8.1.5': [
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'График выполнения плана проверок',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_Дорожная карта (график) выполнения плана проверок.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_Дорожная карта (график) выполнения плана проверок.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_1_5_Дорожная карта (график) выполнения плана проверок.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_Дорожная карта (график) выполнения плана проверок.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130006',
        },
        {
          type: 'ODT',
          name: '8_1_5_Дорожная карта (график) выполнения плана проверок.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130006',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Донесение об устранении недостатков',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_донесение об устранении недостатков.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_донесение об устранении недостатков.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_1_5_донесение об устранении недостатков.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_донесение об устранении недостатков.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130006',
        },
        {
          type: 'ODT',
          name: '8_1_5_донесение об устранении недостатков.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130006',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Донесение о внеплановой проверке',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_донесение о внеплановой проверке.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_донесение о внеплановой проверке.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_1_5_донесение о внеплановой проверке.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_донесение о внеплановой проверке.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_5_донесение о внеплановой проверке.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Донесение о начале проведении проверки',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_донесение о начале проведения проверки.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_донесение о начале проведения проверки.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_1_5_донесение о начале проведения проверки.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_донесение о начале проведения проверки.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_5_донесение о начале проведения проверки.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Донесение о переносе(отмена запланированной проверки)',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_донесение о переносе(отмены) запланированной проверки.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_донесение о переносе(отмены) запланированной проверки.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_1_5_донесение о переносе(отмены) запланированной проверки.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_донесение о переносе(отмены) запланированной проверки.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_5_донесение о переносе(отмены) запланированной проверки.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Контрольные карточки',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_контрольные карточки.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_контрольные карточки.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_1_5_контрольные карточки.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_контрольные карточки.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_5_контрольные карточки.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'План устранения недостатков',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_планы устранения недостатков.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_планы устранения недостатков.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_1_5_планы устранения недостатков.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_планы устранения недостатков.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_5_планы устранения недостатков.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Результат проверок',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_Результаты выполнения плана проверок за неделю.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_Результаты выполнения плана проверок за неделю.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_Результаты выполнения плана проверок за неделю.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Сведения по спланированных проверкам',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_Сведения по спланированным проверкам на месяц.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_Сведения по спланированным проверкам на месяц.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_Сведения по спланированным проверкам на месяц.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Акт проверок',
      files: [
        {
          type: 'FODT',
          name: '8_1_5_акт проверок.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_1_5_акт проверок.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_1_5_акт проверок.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_1_5_акт проверок.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_5_акт проверок.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },

  ],
  '8.1.6': [
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'График состояния связи',
      files: [
        {
          type: 'FODT',
          name: '8_1_6_График состояния связи.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_6_График состояния связи.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_6_График состояния связи.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_6_График состояния связи.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_6_График состояния связи.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Обеспеченность техники связи',
      files: [
        {
          type: 'FODT',
          name: '8_1_6_Обеспеченность техники связи.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_6_Обеспеченность техники связи.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_6_Обеспеченность техники связи.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_6_Обеспеченность техники связи.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_6_Обеспеченность техники связи.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Состояние средства АСУ',
      files: [
        {
          type: 'FODT',
          name: '8_1_6_Состояние средств АСУ.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_6_Состояние средств АСУ.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_6_Состояние средств АСУ.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_6_Состояние средств АСУ.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_6_Состояние средств АСУ.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Схема приказ',
      files: [
        {
          type: 'FODT',
          name: '8_1_6_схема-приказ А4.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_6_схема-приказ А4.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_6_схема-приказ А4.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Укомплектованность',
      files: [
        {
          type: 'FODT',
          name: '8_1_6_Укомплектованность УС.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_6_Укомплектованность УС.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_6_Укомплектованность УС.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'ODT',
          name: '8_1_6_Укомплектованность УС.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_6_Укомплектованность УС.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
      ],
    },
  ],
  '8.1.9': [
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Ведомость контроля донесения служб',
      files: [
        {
          type: 'FODT',
          name: '8_1_9_Ведомость контроля несения службы дежурных смен.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_9_Ведомость контроля несения службы дежурных смен.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_9_Ведомость контроля несения службы дежурных смен.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_9_Ведомость контроля несения службы дежурных смен.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_9_Ведомость контроля несения службы дежурных смен.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Итоговая таблица дежурной смены',
      files: [
        {
          type: 'FODT',
          name: '8_1_9_Итоговая таблица первой дежурной смены.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_9_Итоговая таблица первой дежурной смены.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_9_Итоговая таблица первой дежурной смены.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_9_Итоговая таблица первой дежурной смены.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_9_Итоговая таблица первой дежурной смены.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Состав ДС по БУ',
      files: [
        {
          type: 'FODT',
          name: '8_1_9_Состав ДС по БУ.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_9_Состав ДС по БУ.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_9_Состав ДС по БУ.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_9_Состав ДС по БУ.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_1_9_Состав ДС по БУ.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Состав ДС по ПД',
      files: [
        {
          type: 'FODT',
          name: '8_1_9_Состав ДС по ПД.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_9_Состав ДС по ПД.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_9_Состав ДС по ПД.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_9_Состав ДС по ПД.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'ODT',
          name: '8_1_9_Состав ДС по ПД.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Список личного состава первой ДС',
      files: [
        {
          type: 'FODT',
          name: '8_1_9_Список личного состава перовой дежурной смены.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130003',
        },
        {
          type: 'JSON',
          name: '8_1_9_Список личного состава перовой дежурной смены.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'PDF',
          name: '8_1_9_Список личного состава перовой дежурной смены.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'XML',
          name: '8_1_9_Список личного состава перовой дежурной смены.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
        {
          type: 'ODT',
          name: '8_1_9_Список личного состава перовой дежурной смены.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130004',
        },
      ],
    },
  ],
  '8.2.2': [
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Ведомость контроля',
      files: [
        {
          type: 'FODT',
          name: '8_2_2_Ведомость контроля сил и средств противодействия терроризму.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'JSON',
          name: '8_2_2_Ведомость контроля сил и средств противодействия терроризму.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'ODT',
          name: '8_2_2_Ведомость контроля сил и средств противодействия терроризму.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'PDF',
          name: '8_2_2_Ведомость контроля сил и средств противодействия терроризму.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'XML',
          name: '8_2_2_Ведомость контроля сил и средств противодействия терроризму.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Донесение по противодействию терроризму',
      files: [
        {
          type: 'FODT',
          name: '8_2_2_Донесение по противодействию терроризму.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'JSON',
          name: '8_2_2_Донесение по противодействию терроризму.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'ODT',
          name: '8_2_2_Донесение по противодействию терроризму.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'PDF',
          name: '8_2_2_Донесение по противодействию терроризму.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'XML',
          name: '8_2_2_Донесение по противодействию терроризму.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
      ],
    },
  ],
  '8.2.4': [
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Анализ мероприятия по парашютному спорту',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Доклад о выполненных мероприятиях',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Доклад о готовности к дессантированию',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Доклад о планируемых прыжках',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Доклад о свершенных прыжках',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Доклад о состоянии СПД',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Донесение о состоянии ВДС',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Заявка на выделение авиации',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Обощенный сведения о выполнении прыжков',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'План прыжков с парашютом',
      files: [
        {
          type: 'FODT',
          name: '8_2_4_План прыжков с парашютом.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'JSON',
          name: '8_2_4_План прыжков с парашютом.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'XML',
          name: '8_2_4_План прыжков с парашютом.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'ODT',
          name: '8_2_4_План прыжков с парашютом.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'PDF',
          name: '8_2_4_План прыжков с парашютом.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'План прыжков на учебный год',
      files: [
        {
          type: 'FODT',
          name: '8_2_4_План прыжков на учебный год.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'JSON',
          name: '8_2_4_План прыжков на учебный год.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'XML',
          name: '8_2_4_План прыжков на учебный год.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'ODT',
          name: '8_2_4_План прыжков на учебный год.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'PDF',
          name: '8_2_4_План прыжков на учебный год.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
      ],
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Сведения о совершенных прыжках',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Справка доклад',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Таблица контроля прыжков',
      files: [],
      disabled: true,
    },
    {
      uuid: '6ccb2d66-f452-1144-9a03-0242ac130005',
      name: 'Выполнение плана дессантирования',
      files: [
        {
          type: 'FODT',
          name: '8_2_4_Выполнение плана десантирования.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'JSON',
          name: '8_2_4_Выполнение плана десантирования.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'XML',
          name: '8_2_4_Выполнение плана десантирования.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'ODT',
          name: '8_2_4_Выполнение плана десантирования.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
        {
          type: 'PDF',
          name: '8_2_4_Выполнение плана десантирования.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130088',
        },
      ],
      disabled: true,
    },
  ],
  '8.2.20': [
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Донесение о состоянии и наличии средств видеонаблюдения',
      files: [
        {
          type: 'FODT',
          name: '8_2_20_Донесение о состоянии и наличии средств видеонаблюдения.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_2_20_Донесение о состоянии и наличии средств видеонаблюдения.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_2_20_Донесение о состоянии и наличии средств видеонаблюдения.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_2_20_Донесение о состоянии и наличии средств видеонаблюдения.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_2_20_Донесение о состоянии и наличии средств видеонаблюдения.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
  ],
  '8.2.29': [
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Донесение актуализации ИМ БД НЦУО',
      files: [
        {
          type: 'FODT',
          name: '8_2_29_Донесение актуализации информационных массивов БД НЦУО.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_2_29_Донесение актуализации информационных массивов БД НЦУО.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_2_29_Донесение актуализации информационных массивов БД НЦУО.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_2_29_Донесение актуализации информационных массивов БД НЦУО.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_2_29_Донесение актуализации информационных массивов БД НЦУО.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Регламент работы ДЛ по актуализации',
      files: [
        {
          type: 'FODT',
          name: '8_2_29_Регламент работы ДЛ по актуализации информационных массивов.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_2_29_Регламент работы ДЛ по актуализации информационных массивов.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_2_29_Регламент работы ДЛ по актуализации информационных массивов.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_2_29_Регламент работы ДЛ по актуализации информационных массивов.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_2_29_Регламент работы ДЛ по актуализации информационных массивов.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Состояние информационных групп',
      files: [
        {
          type: 'FODT',
          name: '8_2_29_Состояние информационных групп.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_2_29_Состояние информационных групп.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_2_29_Состояние информационных групп.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_2_29_Состояние информационных групп.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_2_29_Состояние информационных групп.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
    },
  ],
  '8.2.30': [
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Ведомость исполнения поручений К ВДВ',
      files: [
        {
          type: 'FODT',
          name: '8_2_30_Ведомость исполнения поручений Командующего ВДВ.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_2_30_Ведомость исполнения поручений Командующего ВДВ.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_2_30_Ведомость исполнения поручений Командующего ВДВ.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_2_30_Ведомость исполнения поручений Командующего ВДВ.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_2_30_Ведомость исполнения поручений Командующего ВДВ.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
      mode: 'list',
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Ведомость контроля исполнения указаний ГШ',
      files: [
        {
          type: 'FODT',
          name: '8_2_30_Ведомость контроля исполнения указаний Ген. штаба.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_2_30_Ведомость контроля исполнения указаний Ген. штаба.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_2_30_Ведомость контроля исполнения указаний Ген. штаба.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_2_30_Ведомость контроля исполнения указаний Ген. штаба.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_2_30_Ведомость контроля исполнения указаний Ген. штаба.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
      mode: 'control',
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Замечания находящихся на исполнении поручений',
      files: [
        {
          type: 'FODT',
          name: '8_2_30_Замечания, находящихся на исполнении поручений.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_2_30_Замечания, находящихся на исполнении поручений.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_2_30_Замечания, находящихся на исполнении поручений.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'ODT',
          name: '8_2_30_Замечания, находящихся на исполнении поручений.odt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'PDF',
          name: '8_2_30_Замечания, находящихся на исполнении поручений.pdf',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
      mode: 'notes',
    },
    {
      uuid: 'b391e42a-f451-11eb-9a03-0242ac130004',
      name: 'Донесение - поручения',
      files: [
        {
          type: 'FODT',
          name: '8_2_30_Поручения.fodt',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'JSON',
          name: '8_2_30_Поручения.json',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
        {
          type: 'XML',
          name: '8_2_30_Поручения.xml',
          uuid: '6ccb2d66-f452-11eb-9a03-0242ac130005',
        },
      ],
      mode: 'report',
    },
  ],
};

export const ATTACHED_DOCUMENTS: Document[] = [
  {
    uuid: '88a4a88c-4202-4cd6-b55e-af0596ccf5ec',
    name: 'Макет прикрепленного документа',
    files: [
      {
        uuid: '88a4a88c-4202-4cd6-b55e-af0596ccf777',
        name: 'Макет файла прикрепленного документа',
        size: '650',
        type: 'pdf',
      },
      {
        uuid: '88a4a88c-4202-4cd6-b55e-af0596ccf777',
        name: 'Макет файла прикрепленного документа 2',
        size: '650',
        type: 'pdf',
      },
    ],
    date: '21.04.2021',
    number: '7',
    user: {
      id: 'd0f31b9d-b0db-4138-895c-4b40ef38ba28',
      username: 'shtkvdv01',
      full_name: 'Романов Максим Максимович',
    },
    created_at: '23.02.2021',
  },
  {
    uuid: '88a4a88c-4202-4cd6-b55e-af0596ccf5ec',
    name: 'Макет прикрепленного документа 2',
    files: [
      {
        uuid: '88a4a88c-4202-4cd6-b55e-af0596ccf777',
        name: 'Макет файла прикрепленного документа',
        size: '650',
        type: 'pdf',
      },
      {
        uuid: '88a4a88c-4202-4cd6-b55e-af0596ccf777',
        name: 'Макет файла прикрепленного документа 2',
        size: '650',
        type: 'pdf',
      },
    ],
    date: '21.04.2021',
    number: '7',
    user: {
      id: 'd0f31b9d-b0db-4138-895c-4b40ef38ba28',
      username: 'shtkvdv01',
      full_name: 'Романов Максим Максимович',
    },
    created_at: '23.02.2021',
  },
];
