import { Report } from '../../../../types/interfaceReport';

export const REPORTS: Report[] = [
    {
        uuid: '75f0dc96-f10b-11eb-9a03-0242ac13000',
        sequentialNumber: 1,
        user: 'п-к А. Иванов',
        report: 'Вспомогательные П.у. создаются для достижения частных целей управления. Например технический П.у. создается для управления подразделениями технической ракетной базы и приданными силами и средствами при выполнении ими задач поддержания боевой готовности ракетного и специального вооружения, а также работами, проводимыми на ракетном вооружении.',
    },
    {
        uuid: '99646580-f10b-11eb-9a03-0242ac130003',
        sequentialNumber: 2,
        user: 'п-к А. Иванов',
        report: 'Специально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлени',
    },
    {
        uuid: '7909ef0c-f111-11eb-9a03-0242ac130003',
        sequentialNumber: 3,
        user: 'п-к А. Иванов',
        report: 'Вспомогательные П.у. создаются для достижения частных целей управления. Например технический П.у. создается для управления подразделениями технической ракетной базы и приданными силами и средствами при выполнении ими задач поддержания боевой готовности ракетного и специального вооружения, а также работами, проводимыми на ракетном вооружении.',
    },
    {
        uuid: '9803b5e2-f115-11eb-9a03-0242ac130003',
        sequentialNumber: 4,
        user: 'п-к А. Иванов',
        report: 'Вспомогательные П.у. создаются для достижения частных целей управления. Например технический П.у. создается для управления подразделениями технической ракетной базы и приданными силами и средствами при выполнении ими задач поддержания боевой готовности ракетного и специального вооружения, а также работами, проводимыми на ракетном вооружении.Специально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлени',
    },
    {
        uuid: 'c0a9ec32-f115-11eb-9a03-0242ac130003',
        sequentialNumber: 5,
        user: 'п-к А. Иванов',
        report: 'Вспомогательные П.у. создаются для достижения частных целей управления. Например технический П.у. создается для управления подразделениями технической ракетной базы и приданными силами и средствами при выполнении ими задач поддержания боевой готовности ракетного и специального вооружения, а также работами, проводимыми на ракетном вооружении.Вспомогательные П.у. создаются для достижения частных целей управления. Например технический П.у. создается для управления подразделениями технической ракетной базы и приданными силами и средствами при выполнении ими задач поддержания боевой готовности ракетного и специального вооружения, а также работами, проводимыми на ракетном вооружении.',
    },
    {
        uuid: 'e9e30e30-f115-11eb-9a03-0242ac130003',
        sequentialNumber: 6,
        user: 'п-к А. Иванов',
        report: 'Вспомогательные П.у. создаются для достижения частных целей управления. Например технический П.у. создается для управления подразделениями технической ракетной базы и приданными силами и средствами при выполнении ими задач поддержания боевой готовности ракетного и специального вооружения, а также работами, проводимыми на ракетном вооружении.Специально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлени',
    },
    {
        uuid: '05b0391c-f116-11eb-9a03-0242ac130003',
        sequentialNumber: 7,
        user: 'п-к А. Иванов',
        report: 'Вспомогательные П.у. создаются для достижения частных целей управления. Например технический П.у. создается для управления подразделениями технической ракетной базы и приданными силами и средствами при выполнении ими задач поддержания боевой готовности ракетного и специального вооружения, а также работами, проводимыми на ракетном вооружении.Специально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениВспомогательные П.у. создаются для достижения частных целей управления. Например технический П.у. создается для управления подразделениями технической ракетной базы и приданными силами и средствами при выполнении ими задач поддержания боевой готовности ракетного и специального вооружения, а также работами, проводимыми на ракетном вооружении.Специально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлени',
    },
    {
        uuid: '3dccbe74-f116-11eb-9a03-0242ac130003',
        sequentialNumber: 8,
        user: 'п-к А. Иванов',
        report: 'Вспомогательные П.у. создаются для достижения частных целей управления. Например технический П.у. создается для управления подразделениями технической ракетной базы и приданными силами и средствами при выполнении ими задач поддержания боевой готовности ракетного и специального вооружения, а также работами, проводимыми на ракетном вооружении.Специально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлениСпециально оборудованное и оснащённое техническими средствами место, находясь на котором командующий (командир) с офицерами штаба осуществляет управлени',
    },
];
